content/blog/january-update.md
+++
title = "Updates & A letter to self"
author = ["Prashant Tak"]
draft = false
creator = "Emacs 27.2 (Org mode 9.6 + ox-hugo)"
+++

Hi there, it's been a while.
I doubt anyone's reading these but I felt like writing something regardless.

So I've started going ham into kanji study again, (hopefully this time it's more fruitful) and I think that now I'm getting the appeal of immersion and how beneficial it can be paired with the right amount of active recognition of what you're recalling from your anki reps.

Coming to the S.M.A.R.T. (Specific, Measurable, Attainable, Realistic, and Time Bound) goals regarding japanese, let's try to set some shall we? So that we have something to look forard to and back on.

-   In the month of february, you should ideally finish JLPT N5 vocabulary and kanji, also for kanji, it should be the RRTK450 deck.
-   Alongwith that, you should start repping JP1K if it's manageable.
-   For the final and optional goal, you should try to go through atleast the entire beginner's section of TaeKim.

Moving onto academic stuff, I messed up my sleeping schedule again and due to which I missed an easy test. This had been a problem that has persistently plagued me in the past and has done a lot of harm to my grades. So we should set some lifestyle goals.

-   Sleep around 11 PM, no more late night twitch streams or binging TV shows. You can do the same in between classes or watch highlights later. If you don't set your priorities now, you'll definitely regret it later.
-   One thing that I was very skeptical of in the past was taking baths daily, (even now I get lazy all the time), but what I've realised is that it really helps reset your mind and freshens up your body in inexplicable ways. So you should really try to follow through with this.
-   The major time consuming activites of your day are watching random stuff on streaming websites, to turn that into a positive you should really devote that time into immersion, that'll count towards your language learning hours and leisure time simultaneously.
-   The other major time sink is constantly checking the three social media platforms that you engage with, namely Twitter, Instagram and Discord. Now you shouldn't go all out and stop using these services altogether, you've tried that in the and have failed. A better alternative would be to set time limits/period each day during which you'll browse these networks. For now, a good starting point would be 30 mins each day after 9PM.

Now comes the real stuff, the reason why this post is needed and whenever you feel that you're straying from the goals mentioned here, what you should look back to.

There's an extremely urgent requirement for you to succeed in your college life which most of the shows that you watch fail to depict, that is having good grades. For as long as you've been in college, you've tried to portray yourself as this person that doesn't care about grades and in the process hampered your academic capabilites a lot. This type of attitude would've been fine if you were actually doing well but with that clearly not being the case, it's high time that you really change your attitude. The goals for this semester would be having consistent reviews of daily classes, just look at the situation as doing anki reps, if you miss a single day, it piles up so much that recovering is hard and the burden increases exponentially. Since the semester has just started you can easily make up for the lost time.

-   [A] Daily revisions of the day's classes
-   [B] Preparing for next day's classes
-   [C] Attempt textbook questions

Now it's time for miscellaneous things that you should really focus on in order to really up your skillset and builld up your credentials.

-   Finish SOP work by tuesday, you have that meeting on wednesday which _really, really_ needs to go well. Oh and one more thing that I would've completely missed, finish Power Electronics lab work.
-   Start going through the ITMO lectures, your goal should be to be done with them by the time February comes to an end.
-   One thing which you've been really lackadaisical about is having an internship which would reflect your work ethic and since you didn't really have the grades to sit for them during last season, you thought you'd _"crack"_ GSoC and add that as work experience, alas your sloth-like mentality has put you in a very difficult position when it comes to that too, since you've practically made no effort to keep in touch with the org or contribute towards their project while others have made huge strides, you need to play catch-up now.
-   Start going through their code base, look at issues, merged PRs and previous year successful contributions, try to model them and constantly stay in touch with the org members so that they're aware of your existence. Build up some kind of rapport with them so that they feel like you're in it for the long run.
-   Optional goals for this category would be to work a bit on corfu and mpc/music modules for doom.

This is all I could think of for now, and since your OOP lab's starting in any minute, so it's time to pen down, call it a day and follow through on what you've put out for the whole world to see.

You're responsible for your own success.

Go break a leg! :)
